#+PROPERTY: header-args :results verbatim :tangle pgpb-blog.el :session pgpb :cache no
#+auto_tangle: t


* Blog utilities

** Keybindings

*** Publish Org site
    :PROPERTIES:
    :ID:       419F5786-404F-44BF-A39B-E8096CD8D36F
    :END:
  
  
    #+begin_src elisp
      (global-set-key (kbd "C-c p")
                      (lambda () (interactive) (org-publish "site")))
    #+end_src

    #+RESULTS:
    : (lambda nil (interactive) (org-publish "site"))


** Provide Blog module
   
   #+begin_src elisp
     (provide 'pgpb-blog)
   #+end_src


